app/controllers/items_controller.rb

INSERT INTO "items" ("title", "description", "position", "status", "created_at", "updated_at", "list_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "item a1 2"], ["description", ""], ["position", nil], ["status", false], ["created_at", "2022-03-11 01:52:27.563171"], ["updated_at", "2022-03-11 01:52:27.563171"], ["list_id", 7]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "description" = $1, "position" = $2, "status" = $3, "updated_at" = $4 WHERE "items"."id" = $5  [["description", "é uma tarefa "], ["position", 1], ["status", true], ["updated_at", "2022-03-11 02:21:44.112174"], ["id", 15]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = $1  [["id", 13]]
---
  def destroy
    id_lista_item_destruido = @item.list_id.to_s
    @item.destroy