app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1  [["user_id", 2]]
---
  def index
    @lists = List.all.where(user_id: current_user.id)