app/controllers/lists_controller.rb

  def index
    @cores = ['#fbf8cc', '#fde4cf', '#ffcfd2', '#f1c0e8', '#cfbaf0', '#a3c4f3', '#90dbf4', '#8eecf5', '#b9fbc0']
    @lists = List.all.where(user_id: current_user.id).order(position: :asc)
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = $1 ORDER BY "lists"."position" ASC  [["user_id", 2]]

  def show
    @cores = ['#fbf8cc', '#fde4cf', '#ffcfd2', '#f1c0e8', '#cfbaf0', '#a3c4f3', '#90dbf4', '#8eecf5', '#b9fbc0']
    @id_lista = params[:id]
    @items = Item.all.where(list_id: @id_lista).order(position: :asc)
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = $1 ORDER BY "items"."position" ASC  [["list_id", 14]]

  def create
    @list = List.new(list_params)

    respond_to do |format|
      if @list.save
---
INSERT INTO "lists" ("title", "description", "position", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "lista 10"], ["description", "sdsdfsd"], ["position", 0], ["created_at", "2022-03-13 09:56:44.889030"], ["updated_at", "2022-03-13 09:56:44.889030"], ["user_id", 5]]

  def update
    respond_to do |format|
      if @list.update(list_params)
---
UPDATE "lists" SET "description" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["description", "descricao 1"], ["updated_at", "2022-03-11 19:09:40.068086"], ["id", 14]]